src/cf/InformationRegisters/СоответствияЗагружаемыхРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>СоответствияЗагружаемыхРеквизитов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеВНашейСистеме</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогЭлементРисункаПроизводителяОбои</v8:Type>
						<v8:Type>cfg:CatalogRef.вогЭлементыРисункаОбоев</v8:Type>
						<v8:Type>cfg:CatalogRef.вогВидыСтруктурыПроизводителяОбои</v8:Type>
						<v8:Type>cfg:EnumRef.вогСпособыПроизводстваОбоев</v8:Type>
						<v8:Type>cfg:CatalogRef.вогСтильРисункаПроизводителя</v8:Type>
						<v8:Type>cfg:CatalogRef.вогЦеноваяГруппа</v8:Type>
						<v8:Type>cfg:EnumRef.вогОсноваДляОбоев</v8:Type>
						<v8:Type>cfg:CatalogRef.вогВидыПоверхностиОбоев</v8:Type>
						<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.вогВидыСтруктурыОбоев</v8:Type>
						<v8:Type>cfg:EnumRef.вогРазмерРисункаОбоев</v8:Type>
						<v8:Type>cfg:CatalogRef.вогБренды</v8:Type>
						<v8:Type>cfg:CatalogRef.вогСтилиРисункаОбоев</v8:Type>
						<v8:Type>cfg:CatalogRef.вогЦеновойСегментФабрики</v8:Type>
						<v8:Type>cfg:EnumRef.вогТипРисункаОбоев</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СправочникВНашейСистеме</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТегФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизитаВФайле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеВФайле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СоответствияЗагружаемыхРеквизитов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура СправочникПриИзменении(Элемент)
	Запись.ИмяРеквизитаВФайле		= Справочник;
	Запись.СправочникВНашейСистеме	= Элемент.ТекстРедактирования;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Запись.ТегФайла = "" Тогда
		Запись.ТегФайла = "Палитра";
	КонецЕсли;
	
	Справочник = Запись.ИмяРеквизитаВФайле;
	
КонецПроцедуры

//Brend Бренды
//PatternType Стили рисунка обоев
//Structure Виды структуры обоев
//Information Тип рисунка обоев
//PictureSize Размер рисунка обоев
//PictureElements Элементы рисунка обоев
//Surface Виды поверхности обоев
//Colors Цвета
//Basis Основа для обоев
//TypeProd Способы производства обоев
